/* Flubber Panel: Label on the button to cancel the subscription to the newsletter */
"Cancel" = "Abbrechen";
/* Flubber Panel: Placeholder text for the email field */
"Email Address" = "E-Mail-Adresse";
/* Flubber Panel: Message for the alert to subscribe to the newsletter */
"Enter your email address to subscribe to our mailing list." = "Für die Mailingliste, bitte E-Mail-Adresse eingeben.";
/* Flubber Panel: Label for section with social links */
"Follow us" = "Folge uns";
/* Flubber Panel: Label on button to dismiss the \"no connection\" alert
   Flubber Panel: Label on the button to dismiss the alert displayed when the signup fails */
"OK" = "OK";
/* Flubber Panel: Label for section with other apps */
"Our Apps" = "Unsere Apps";
/* Flubber Panel: Label on the button to subscribe to the newsletter
   Flubber Panel: Title for the alert to subscribe to the newsletter */
"Subscribe" = "Registrieren";
/* Flubber Panel: Title for the alert displayed when the signup fails */
"Subscription Failed" = "Registrieren fehlgeschlagen";
/* Flubber Panel: Message for the alert displayed when the signup fails */
"We couldn't subscribe you to the list. Please check your email address and try again." = "Wir konnten dich für die Liste nicht registrieren. Bitte überprüfe deine E-Mail-Adresse und versuche es erneut.";
/* Flubber Panel: Message when user taps on an App but is not connected to Internet */
"You need an Internet connection to download this App" = "Du brauchst eine Internetverbindung, um diese App herunterzuladen.";